nxp-mcuxpresso/mcux-sdk/devices/MCXW716C/MCXW716C.h
/*! @name RSM_CSR - Ranging Sequence Manager Control and Status */
/*! @{ */

#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_EN_MASK    (0x1U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_EN_SHIFT   (0U)
/*! RSM_IRQ_IP1_EN - RSM_IRQ_IP1_EN */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_EN(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_EN_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_EN_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_MASK       (0x2U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_SHIFT      (1U)
/*! RSM_IRQ_IP1 - RSM_IRQ_IP1 Flag */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP1(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_IP1_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_EN_MASK    (0x4U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_EN_SHIFT   (2U)
/*! RSM_IRQ_IP2_EN - RSM_IRQ_IP2_EN */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_EN(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_EN_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_EN_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_MASK       (0x8U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_SHIFT      (3U)
/*! RSM_IRQ_IP2 - RSM_IRQ_IP2 Flag */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_IP2(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_IP2_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC_EN_MASK     (0x10U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC_EN_SHIFT    (4U)
/*! RSM_IRQ_FC_EN - RSM_IRQ_FC_EN */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC_EN(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_FC_EN_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_FC_EN_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC_MASK        (0x20U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC_SHIFT       (5U)
/*! RSM_IRQ_FC - RSM_IRQ_FC Flag */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_FC(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_FC_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_FC_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_EN_MASK    (0x40U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_EN_SHIFT   (6U)
/*! RSM_IRQ_EOS_EN - RSM_IRQ_EOS_EN */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_EN(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_EN_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_EN_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_MASK       (0x80U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_SHIFT      (7U)
/*! RSM_IRQ_EOS - RSM_IRQ_EOS Flag */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_EOS(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_EOS_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_EN_MASK  (0x100U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_EN_SHIFT (8U)
/*! RSM_IRQ_ABORT_EN - RSM_IRQ_ABORT_EN */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_EN(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_EN_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_EN_MASK)

#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_MASK     (0x200U)
#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_SHIFT    (9U)
/*! RSM_IRQ_ABORT - RSM_IRQ_ABORT Flag */
#define XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_IRQ_ABORT_MASK)

#define XCVR_MISC_RSM_CSR_RSM_STATE_MASK         (0x1F0000U)
#define XCVR_MISC_RSM_CSR_RSM_STATE_SHIFT        (16U)
/*! RSM_STATE - RSM_STATE
 *  0b00000..IDLE
 *  0b00001..DELAY. Used only for the trigger delay in SQTE
 *  0b00010..EXT_TX (Extend TX). Used only for PDE
 *  0b00011..EXT_RX (Extend RX). Used only for PDE
 *  0b00100..WU (Warmup). Used only for SQTE
 *  0b00101..DT_TX (Packet TX). Used only for SQTE
 *  0b00110..DT_RX (Packet RX). Used only for SQTE
 *  0b00111..DT_RX_SYNC (Packet RX Sync). Used only for SQTE
 *  0b01000..FM_TX (Frequency Measurement TX). Used only for SQTE
 *  0b01001..FM_RX (Frequency Measurement RX). Used only for SQTE
 *  0b01010..PM_TX (Phase Measurement TX).
 *  0b01011..PM_RX (Phase Measurement RX).
 *  0b01100..IP1_RX2TX (Interlude Period 1 RX2TX). Used only for SQTE
 *  0b01101..IP1_TX2RX (Interlude Period 1 TX2RX). Used only for SQTE
 *  0b01110..S_RX2RX (Short Period RX2RX). Used only for SQTE
 *  0b01111..S_TX2TX (Short Period TX2TX). Used only for SQTE
 *  0b10000..IP2_RX2TX (Interlude Period 2 RX2TX).
 *  0b10001..IP2_TX2RX (Interlude Period 2 TX2RX).
 *  0b10010..FC_RX2TX (Frequency Change RX2TX).
 *  0b10011..FC_TX2RX (Frequency Change TX2RX).
 *  0b10100..WD (Warmdown)
 */
#define XCVR_MISC_RSM_CSR_RSM_STATE(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_STATE_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_STATE_MASK)

#define XCVR_MISC_RSM_CSR_RSM_STEP_FORMAT_MASK   (0x600000U)
#define XCVR_MISC_RSM_CSR_RSM_STEP_FORMAT_SHIFT  (21U)
/*! RSM_STEP_FORMAT - RSM_STEP_FORMAT */
#define XCVR_MISC_RSM_CSR_RSM_STEP_FORMAT(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_STEP_FORMAT_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_STEP_FORMAT_MASK)

#define XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_MASK (0xFF000000U)
#define XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_SHIFT (24U)
/*! RSM_CURRENT_STEPS - RSM_CURRENT_STEPS */
#define XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_SHIFT)) & XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_MASK)
/*! @} */

/*! @name RSM_CTRL0 - Ranging Sequence Manager Control */
/*! @{ */

#define XCVR_MISC_RSM_CTRL0_RSM_MODE_MASK        (0x1U)
#define XCVR_MISC_RSM_CTRL0_RSM_MODE_SHIFT       (0U)
/*! RSM_MODE - RSM_MODE
 *  0b0..SQTE
 *  0b1..PDE
 */
#define XCVR_MISC_RSM_CTRL0_RSM_MODE(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_MODE_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_MODE_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_RATE_MASK        (0x2U)
#define XCVR_MISC_RSM_CTRL0_RSM_RATE_SHIFT       (1U)
/*! RSM_RATE - RSM_RATE
 *  0b0..1Mbps
 *  0b1..2Mbps
 */
#define XCVR_MISC_RSM_CTRL0_RSM_RATE(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_RATE_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_RATE_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_RX_EN_MASK       (0x4U)
#define XCVR_MISC_RSM_CTRL0_RSM_RX_EN_SHIFT      (2U)
/*! RSM_RX_EN - RSM_RX_EN */
#define XCVR_MISC_RSM_CTRL0_RSM_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_RX_EN_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_RX_EN_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_TX_EN_MASK       (0x8U)
#define XCVR_MISC_RSM_CTRL0_RSM_TX_EN_SHIFT      (3U)
/*! RSM_TX_EN - RSM_TX_EN */
#define XCVR_MISC_RSM_CTRL0_RSM_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_TX_EN_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_TX_EN_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_RX_WU_MASK (0x10U)
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_RX_WU_SHIFT (4U)
/*! RSM_FAST_IP_RX_WU - RSM_FAST_IP_RX_WU */
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_RX_WU(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_RX_WU_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_RX_WU_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_TX_WU_MASK (0x20U)
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_TX_WU_SHIFT (5U)
/*! RSM_FAST_IP_TX_WU - RSM_FAST_IP_TX_WU */
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_TX_WU(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_TX_WU_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_FAST_IP_TX_WU_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_RX_WU_MASK (0x40U)
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_RX_WU_SHIFT (6U)
/*! RSM_FAST_FC_RX_WU - RSM_FAST_FC_RX_WU */
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_RX_WU(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_RX_WU_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_RX_WU_MASK)

#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_TX_WU_MASK (0x80U)
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_TX_WU_SHIFT (7U)
/*! RSM_FAST_FC_TX_WU - RSM_FAST_FC_TX_WU */
#define XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_TX_WU(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_TX_WU_SHIFT)) & XCVR_MISC_RSM_CTRL0_RSM_FAST_FC_TX_WU_MASK)

