nxp-mcuxpresso/mcux-sdk/devices/MCXW716C/MCXW716C.h
/*! @name CCA2_CTRL - CCA MODE 2 CONTROL REGISTER */
/*! @{ */

#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_INTERVAL_MASK (0x3U)
#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_INTERVAL_SHIFT (0U)
/*! CCA2_INTERVAL - CCA Mode 2 Measurement Window Duration
 *  0b00..64 us
 *  0b01..128 us
 *  0b10..256 us
 *  0b11..512 us
 */
#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_INTERVAL(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_CTRL_CCA2_INTERVAL_SHIFT)) & XCVR_ZBDEMOD_CCA2_CTRL_CCA2_INTERVAL_MASK)

#define XCVR_ZBDEMOD_CCA2_CTRL_USE_DEMOD_CCA2_MASK (0x4U)
#define XCVR_ZBDEMOD_CCA2_CTRL_USE_DEMOD_CCA2_SHIFT (2U)
/*! USE_DEMOD_CCA2 - Selects CCA Mode 2 Computation Engine
 *  0b0..Use standalone (new) CCA Mode 2 Engine, decoupled from demodulator
 *  0b1..Use 802.15.4 demodulator-based (legacy) CCA Mode 2 Engine (default)
 */
#define XCVR_ZBDEMOD_CCA2_CTRL_USE_DEMOD_CCA2(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_CTRL_USE_DEMOD_CCA2_SHIFT)) & XCVR_ZBDEMOD_CCA2_CTRL_USE_DEMOD_CCA2_MASK)

#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_REF_SEQ_MASK (0xFF00U)
#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_REF_SEQ_SHIFT (8U)
/*! CCA2_REF_SEQ - CCA Mode 2 Sequence Address */
#define XCVR_ZBDEMOD_CCA2_CTRL_CCA2_REF_SEQ(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_CTRL_CCA2_REF_SEQ_SHIFT)) & XCVR_ZBDEMOD_CCA2_CTRL_CCA2_REF_SEQ_MASK)
/*! @} */

/*! @name CCA2_THRESH - CCA MODE 2 CONTROL REGISTER */
/*! @{ */

#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_CNT_THRESH_MASK (0x3FFU)
#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_CNT_THRESH_SHIFT (0U)
/*! CCA2_CNT_THRESH - CCA Mode 2 Count Threshold */
#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_CNT_THRESH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_THRESH_CCA2_CNT_THRESH_SHIFT)) & XCVR_ZBDEMOD_CCA2_THRESH_CCA2_CNT_THRESH_MASK)

#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_SYM_THRESH_MASK (0x3FF0000U)
#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_SYM_THRESH_SHIFT (16U)
/*! CCA2_SYM_THRESH - CCA Mode 2 Symbol Threshold */
#define XCVR_ZBDEMOD_CCA2_THRESH_CCA2_SYM_THRESH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_THRESH_CCA2_SYM_THRESH_SHIFT)) & XCVR_ZBDEMOD_CCA2_THRESH_CCA2_SYM_THRESH_MASK)
/*! @} */

/*! @name CCA2_STATUS - CCA MODE 2 STATUS REGISTER */
/*! @{ */

#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_MAX_MASK (0x3FFU)
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_MAX_SHIFT (0U)
/*! CCA2_CNT_MAX - CCA Mode 2 Maximum Count */
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_MAX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_MAX_SHIFT)) & XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_MAX_MASK)

#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_COMPLETE_MASK (0x400U)
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_COMPLETE_SHIFT (10U)
/*! CCA2_COMPLETE - CCA Mode 2 Measurement Complete */
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_COMPLETE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_STATUS_CCA2_COMPLETE_SHIFT)) & XCVR_ZBDEMOD_CCA2_STATUS_CCA2_COMPLETE_MASK)

#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CHANNEL_STATE_MASK (0x800U)
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CHANNEL_STATE_SHIFT (11U)
/*! CCA2_CHANNEL_STATE - CCA Mode 2 Channel State */
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CHANNEL_STATE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CHANNEL_STATE_SHIFT)) & XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CHANNEL_STATE_MASK)

#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_SYM_MASK (0x3FF0000U)
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_SYM_SHIFT (16U)
/*! CCA2_CNT_SYM - CCA Mode 2 Repetition Sequence Addresses Count */
#define XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_SYM(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_SYM_SHIFT)) & XCVR_ZBDEMOD_CCA2_STATUS_CCA2_CNT_SYM_MASK)
/*! @} */

/*! @name CORR_CTRL2 - 802.15.4 DEMOD CORRELATOR CONTROL2 */
/*! @{ */

#define XCVR_ZBDEMOD_CORR_CTRL2_EARLY_PD_THRESH_MASK (0xFFU)
#define XCVR_ZBDEMOD_CORR_CTRL2_EARLY_PD_THRESH_SHIFT (0U)
/*! EARLY_PD_THRESH - EARLY_PD_THRESH */
#define XCVR_ZBDEMOD_CORR_CTRL2_EARLY_PD_THRESH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ZBDEMOD_CORR_CTRL2_EARLY_PD_THRESH_SHIFT)) & XCVR_ZBDEMOD_CORR_CTRL2_EARLY_PD_THRESH_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_ZBDEMOD_Register_Masks */


/* XCVR_ZBDEMOD - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE                        (0x58A07500u)
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE_NS                     (0x48A07500u)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD                             ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD_NS                          ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE_NS)
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS                  { XCVR_ZBDEMOD_BASE }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS                   { XCVR_ZBDEMOD }
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS_NS               { XCVR_ZBDEMOD_BASE_NS }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS_NS                { XCVR_ZBDEMOD_NS }
#else
  /** Peripheral XCVR_ZBDEMOD base address */
  #define XCVR_ZBDEMOD_BASE                        (0x48A07500u)
  /** Peripheral XCVR_ZBDEMOD base pointer */
  #define XCVR_ZBDEMOD                             ((XCVR_ZBDEMOD_Type *)XCVR_ZBDEMOD_BASE)
  /** Array initializer of XCVR_ZBDEMOD peripheral base addresses */
  #define XCVR_ZBDEMOD_BASE_ADDRS                  { XCVR_ZBDEMOD_BASE }
  /** Array initializer of XCVR_ZBDEMOD peripheral base pointers */
  #define XCVR_ZBDEMOD_BASE_PTRS                   { XCVR_ZBDEMOD }
#endif

/*!
 * @}
 */ /* end of group XCVR_ZBDEMOD_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ZLL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ZLL_Peripheral_Access_Layer ZLL Peripheral Access Layer
 * @{
 */

