nxp-mcuxpresso/mcux-sdk/devices/MCXW716C/MCXW716C.h
#define ZLL_PART_ID_PART_ID_MASK                 (0xFFU)
#define ZLL_PART_ID_PART_ID_SHIFT                (0U)
/*! PART_ID - 802.15.4 Part ID */
#define ZLL_PART_ID_PART_ID(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_PART_ID_PART_ID_SHIFT)) & ZLL_PART_ID_PART_ID_MASK)
/*! @} */

/*! @name COEX_CTRL - COEXISTENCE CONTROL */
/*! @{ */

#define ZLL_COEX_CTRL_COEX_EN_MASK               (0x1U)
#define ZLL_COEX_CTRL_COEX_EN_SHIFT              (0U)
/*! COEX_EN - Coexistence Enable
 *  0b0..Coexistence function is disabled.
 *  0b1..Coexistence function is enabled.
 */
#define ZLL_COEX_CTRL_COEX_EN(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_EN_SHIFT)) & ZLL_COEX_CTRL_COEX_EN_MASK)

#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_MASK     (0x2U)
#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_SHIFT    (1U)
/*! COEX_REQ_DELAY_EN - Coexistence Request Delay Enable
 *  0b0..arb_request is not delayed during R sequence.
 *  0b1..arb_request is delayed until preamble is detected during R sequence.
 */
#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_SHIFT)) & ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_MASK)

#define ZLL_COEX_CTRL_COEX_REQ_ON_PD_MASK        (0x4U)
#define ZLL_COEX_CTRL_COEX_REQ_ON_PD_SHIFT       (2U)
/*! COEX_REQ_ON_PD - Coexistence Request on Preamble detected
 *  0b0..arb_request is delayed until SFD is detected during R sequence.
 *  0b1..arb_request is delayed until preamble is detected during R sequence.
 */
#define ZLL_COEX_CTRL_COEX_REQ_ON_PD(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_REQ_ON_PD_SHIFT)) & ZLL_COEX_CTRL_COEX_REQ_ON_PD_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_MASK      (0x40U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_SHIFT     (6U)
/*! COEX_TIMEOUT_MSK - Coexistence Timeout Interrupt Mask bit
 *  0b0..allows interrupt when coexistence timeout
 *  0b1..Interrupt generation is disabled, but a COEX_TIMEOUT_IRQ flag can be set
 */
#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_MASK      (0x80U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_SHIFT     (7U)
/*! COEX_TIMEOUT_IRQ - Coexistence Timeout Interrupt */
#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_MASK          (0xFF00U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_SHIFT         (8U)
/*! COEX_TIMEOUT - Coexistence timeout value */
#define ZLL_COEX_CTRL_COEX_TIMEOUT(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_MASK)
/*! @} */

/*! @name COEX_PRIORITY - COEXISTENCE PRIORITY */
/*! @{ */

#define ZLL_COEX_PRIORITY_PRIORITY_T_MASK        (0x3U)
#define ZLL_COEX_PRIORITY_PRIORITY_T_SHIFT       (0U)
/*! PRIORITY_T - PRIORITY_T */
#define ZLL_COEX_PRIORITY_PRIORITY_T(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_T_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_T_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE_MASK    (0xCU)
#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE_SHIFT   (2U)
/*! PRIORITY_R_PRE - PRIORITY_R_PRE */
#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_R_PRE_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_R_PRE_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT_MASK    (0x30U)
#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT_SHIFT   (4U)
/*! PRIORITY_R_PKT - PRIORITY_R_PKT */
#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_R_PKT_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_R_PKT_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_TACK_MASK     (0xC0U)
#define ZLL_COEX_PRIORITY_PRIORITY_TACK_SHIFT    (6U)
/*! PRIORITY_TACK - PRIORITY_TACK */
#define ZLL_COEX_PRIORITY_PRIORITY_TACK(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_TACK_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_TACK_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CCA_MASK      (0x300U)
#define ZLL_COEX_PRIORITY_PRIORITY_CCA_SHIFT     (8U)
/*! PRIORITY_CCA - PRIORITY_CCA */
#define ZLL_COEX_PRIORITY_PRIORITY_CCA(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CCA_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CCA_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CCCA_MASK     (0xC00U)
#define ZLL_COEX_PRIORITY_PRIORITY_CCCA_SHIFT    (10U)
/*! PRIORITY_CCCA - PRIORITY_CCCA */
#define ZLL_COEX_PRIORITY_PRIORITY_CCCA(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CCCA_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CCCA_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CTX_MASK      (0x3000U)
#define ZLL_COEX_PRIORITY_PRIORITY_CTX_SHIFT     (12U)
/*! PRIORITY_CTX - PRIORITY_CT */
#define ZLL_COEX_PRIORITY_PRIORITY_CTX(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CTX_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CTX_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_MASK (0xC000U)
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_SHIFT (14U)
/*! PRIORITY_RACK_PRE - PRIORITY_RACK_PRE */
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_MASK (0x30000U)
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_SHIFT (16U)
/*! PRIORITY_RACK_PKT - PRIORITY_RACK_PKT */
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_MASK     (0x60000000U)
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_SHIFT    (29U)
/*! PRIORITY_OVRD - PRIORITY_OVRD */
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_OVRD_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_OVRD_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_MASK  (0x80000000U)
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_SHIFT (31U)
/*! PRIORITY_OVRD_EN - PRIORITY_OVRD_EN
 *  0b0..Disable overriding PRIORITY value.
 *  0b1..Enable overriding PRIORITY value.
 */
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_MASK)
/*! @} */

