nxp-mcuxpresso/mcux-sdk/devices/MCXW716C/MCXW716C.h
/*! @name ENHACK_CTRL0 - ENHACK_CTRL 0 */
/*! @{ */

#define ZLL_ENHACK_CTRL0_ENHACK_EN_MASK          (0x1U)
#define ZLL_ENHACK_CTRL0_ENHACK_EN_SHIFT         (0U)
/*! ENHACK_EN - Enhanced Acknowledgment Enable
 *  0b0..Enhanced acknowledgment is disabled.
 *  0b1..Enhanced acknowledgment is enabled.
 */
#define ZLL_ENHACK_CTRL0_ENHACK_EN(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ENHACK_EN_SHIFT)) & ZLL_ENHACK_CTRL0_ENHACK_EN_MASK)

#define ZLL_ENHACK_CTRL0_SW_LEN_RDY_MASK         (0x2U)
#define ZLL_ENHACK_CTRL0_SW_LEN_RDY_SHIFT        (1U)
/*! SW_LEN_RDY - Software enhanced acknowledgment frame Length field ready
 *  0b1..Software enhanced acknowledgment frame Length field is ready in RAM
 *  0b0..Software enhanced acknowledgment frame Length field is not ready.
 */
#define ZLL_ENHACK_CTRL0_SW_LEN_RDY(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_LEN_RDY_SHIFT)) & ZLL_ENHACK_CTRL0_SW_LEN_RDY_MASK)

#define ZLL_ENHACK_CTRL0_SW_HIE_RDY_MASK         (0x4U)
#define ZLL_ENHACK_CTRL0_SW_HIE_RDY_SHIFT        (2U)
/*! SW_HIE_RDY - Software enhanced acknowledgment frame HIE field ready
 *  0b1..Software enhanced acknowledgment frame HIE field is ready in RAM
 *  0b0..Software enhanced acknowledgment frame HIE field is not ready.
 */
#define ZLL_ENHACK_CTRL0_SW_HIE_RDY(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_HIE_RDY_SHIFT)) & ZLL_ENHACK_CTRL0_SW_HIE_RDY_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_MASK (0x10U)
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_SHIFT (4U)
/*! EMPTY_SECURITY_ENABLED_OVRD - Override value of Security Enabled field in Empty Enhanced Acknowledgment */
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_MASK (0x60U)
#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_SHIFT (5U)
/*! EMPTY_SRC_ADDR_MODE - Source Address Mode field in Empty Enhanced Acknowledgment */
#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_MASK)

#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_MASK      (0xFF00U)
#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_SHIFT     (8U)
/*! SW_MHR_LENGTH - Software calculated MHR(excludes the HIE field) Length in bytes. */
#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_SHIFT)) & ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_MASK)

#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_MASK   (0x10000U)
#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_SHIFT  (16U)
/*! HW_FRAME_PENDING - Hardware calculated Frame Pending field */
#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_SHIFT)) & ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_MASK (0x40000U)
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_SHIFT (18U)
/*! EMPTY_SECURITY_ENABLED_OVRD_EN - Override enable of Security Enabled field in Empty Enhanced Acknowledgment
 *  0b0..Security Enabled field in Empty Enhanced Acknowledgment frame is 0.
 *  0b1..Security Enabled field in Empty Enhanced Acknowledgment frame is from EMPTY_SECURITY_ENABLED_OVRD.
 */
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_MASK)

#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_MASK      (0x4000000U)
#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_SHIFT     (26U)
/*! ACK_ABORT_MSK - Enhanced Acknowledgment Abort IRQ Mask bit
 *  0b0..allows interrupt when HIE field is not ready by software.
 *  0b1..Interrupt generation is disabled, but a ACK_ABORT_IRQ flag can be set
 */
#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_MASK)

#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_MASK      (0x8000000U)
#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_SHIFT     (27U)
/*! ACK_ABORT_IRQ - Enhanced Acknowledgment Abort IRQ */
#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_MASK      (0x10000000U)
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_SHIFT     (28U)
/*! EMPTY_ACK_MSK - Empty Enhanced Acknowledgment IRQ Mask bit
 *  0b0..allows interrupt when Empty Enhanced Acknowledgment
 *  0b1..Interrupt generation is disabled, but a EMPTY_ACK_IRQ flag can be set
 */
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_MASK      (0x20000000U)
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_SHIFT     (29U)
/*! EMPTY_ACK_IRQ - Empty Enhanced Acknowledgment IRQ */
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_MASK)

#define ZLL_ENHACK_CTRL0_RECYC_MSK_MASK          (0x40000000U)
#define ZLL_ENHACK_CTRL0_RECYC_MSK_SHIFT         (30U)
/*! RECYC_MSK - Recycle IRQ Mask bit
 *  0b0..allows interrupt when recycle
 *  0b1..Interrupt generation is disabled, but a RECYC_IRQ flag can be set
 */
#define ZLL_ENHACK_CTRL0_RECYC_MSK(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_RECYC_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_RECYC_MSK_MASK)

#define ZLL_ENHACK_CTRL0_RECYC_IRQ_MASK          (0x80000000U)
#define ZLL_ENHACK_CTRL0_RECYC_IRQ_SHIFT         (31U)
/*! RECYC_IRQ - Recycle IRQ */
#define ZLL_ENHACK_CTRL0_RECYC_IRQ(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_RECYC_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_RECYC_IRQ_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ZLL_Register_Masks */


/* ZLL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ZLL base address */
  #define ZLL_BASE                                 (0x58A01000u)
  /** Peripheral ZLL base address */
  #define ZLL_BASE_NS                              (0x48A01000u)
  /** Peripheral ZLL base pointer */
  #define ZLL                                      ((ZLL_Type *)ZLL_BASE)
  /** Peripheral ZLL base pointer */
  #define ZLL_NS                                   ((ZLL_Type *)ZLL_BASE_NS)
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS                           { ZLL_BASE }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS                            { ZLL }
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS_NS                        { ZLL_BASE_NS }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS_NS                         { ZLL_NS }
#else
  /** Peripheral ZLL base address */
  #define ZLL_BASE                                 (0x48A01000u)
  /** Peripheral ZLL base pointer */
  #define ZLL                                      ((ZLL_Type *)ZLL_BASE)
  /** Array initializer of ZLL peripheral base addresses */
  #define ZLL_BASE_ADDRS                           { ZLL_BASE }
  /** Array initializer of ZLL peripheral base pointers */
  #define ZLL_BASE_PTRS                            { ZLL }
#endif

/*!
 * @}
 */ /* end of group ZLL_Peripheral_Access_Layer */


